Revit 2027 API
BendingDetailCustomFieldProperties.SegmentLengthDimensionTypeId Property
 Identifies the Id of the linear dimension type which is used to show segments length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SegmentLengthDimensionTypeId { get; set; }
Public Property SegmentLengthDimensionTypeId As ElementId
	Get
	Set
public:
property ElementId^ SegmentLengthDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SegmentLengthDimensionTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The segmentLengthDimensionTypeId should be an id of a linear dimension type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace